/*******************************************************************************
**文件名:DrvFram.c
**
**功能:端口初始化、端口功能配置、端口方向配置
**
**作者:
**
**日期:2016-03-01
**
**修改内容:
**
**作者:
**
**日期:
**
*******************************************************************************/

#include "DrvFram.h"
/*******************************************************************************
**函数名:void FramInit()
**
**功能: FRAM初始化函数，用于对FRAM相关的寄存器进行配置。通过寄存器配置完成FRAM不
**
**同分段的权限配置
**
**作者：HJH
**
**日期：216-06-02
**
**修改内容：
**
**作者：
**
**日期：
*******************************************************************************/
/*
void FramInit()
{
  ;
}
*/
/*******************************************************************************
**函数名:void FramReadData(unsigned long data_point,unsigned long  fram_point,
**                  
**T_U16 data_num)
**
**功能: FRAM读函数，将存放在FRAM中的数据读取出来。data_point:用来存放数据写入地
**
**址；fram_point:用来存放数据读取地址；data_num:要从FRAM中读取的数据量，数据以长
**
**整形作为基本单位，即每一个数据占用4个字节
**
**作者：
**
**日期：
**
**修改内容：
**
**作者：
**
**日期：
*******************************************************************************/
T_U32 g_frame_read_data_buff[20]={0};
void FramReadData(T_U32 *data_pt,T_U32 *fram_pt,T_U16 byte_num)
{
  T_U16 i;
  for(i = 0;i < byte_num;i++)
  {
    *data_pt++ = *fram_pt++; //add++ modified 09.13 
  }
}

/*******************************************************************************
**函数名:void FramWriteData(unsigned long  data_point,unsigned long  fram_point,
**
**T_U16 data_num)
**
**功能: FRAM写函数，将要存储的数据写入到FRAM中。data_point:用来存放待写入FRAM中
**
**的数据地址；fram_point:用来存放数据写入的FRAM地址；data_num:要写入的数据量，以
**
**4个字节为单位，即一个数据占用4个字节(32位)
**
**作者：HJH
**
**日期：2016-06-02
**
**修改内容：
**
**作者：
**
**日期：
*******************************************************************************/
void FramWriteData(T_U32 *data_pt,T_U32 *fram_pt,T_U16 byte_num)
{
  T_U16 i;
  for(i = 0;i < byte_num;i++)
  {
    *fram_pt++ = *data_pt++;  //++ modified 09.13
  }
}

